cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "mas"

# Utils
brew "ack"
brew "ag"
brew "azure-cli"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "duti"
brew "findutils"
brew "git"
brew "gh"
brew "htop"
brew "moreutils"
brew "ncdu"
brew "ngrok/ngrok/ngrok"
brew "openssl"
brew "p7zip"
brew "pigz"
brew "prettyping"
brew "pv"
brew "qpdf"
brew "tldr"
brew "tree"
brew "webkit2png"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-syntax-highlighting"

# Apps
cask "1password"
cask "azure-data-studio"
cask "bartender"
# mas "BetterSnapTool", id:417375580
cask "boop"
mas install "CLocker" id:1056643111
# cask "daisydisk"
mas install "Dropover", id:1355679052
mas install "Evernote", id:406056744
cask "fantastical"
cask "google-chrome"
mas "Hand Mirror", id:1502839586
cask "iina"
mas "Magnet", id:441258766
cask "microsoft-azure-storage-explorer"
cask "obs"
brew "openvpn"
cask "postman"
cask "raycast"
cask "slack"
mas "Spark – Email App by Readdle", id:1176895641
cask "snipaste"
cask "spotify"
cask "textsniper"
cask "transmit"
# mas "Vinegar - Tube Cleaner", id:1591303229
cask "zoom"

# IDE-ish
brew "neovim"
cask "rider"
cask "visual-studio-code"
mas "Xcode", id: 497799835

# Programming
cask "dotnet"
brew "node"

# Misc
cask "font-fira-code"

echo "Dropshare"
