cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "espanso/espanso"
tap "azure/azd"
tap "jesseduffield/lazygit/lazygit"
tap "jesseduffield/lazydocker/lazydocker"
tap "FelixKratz/formulae"

brew "mas"

# Utils
brew "1password-cli"
brew "ack"
cask "nikitabobko/tap/aerospace"
brew "ag"
brew "azd"
brew "azure-cli"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "duti"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "findutils"
brew "fzf"
brew "git"
brew "gh"
brew "htop"
brew "imagemagick"
brew "jq"
brew "moreutils"
brew "ncdu"
brew "ngrok/ngrok/ngrok"
brew "openssl"
brew "p7zip"
brew "pipet"
brew "pigz"
brew "pngpaste"
brew "poppler"
brew "prettyping"
brew "pv"
brew "pure"
brew "qpdf"
brew "ripgrep"
brew "sevenzip"
brew "sketchybar"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "webkit2png"
brew "yarn"
brew "yq"
brew "z"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# Apps
cask "1password"
# cask "nikitabobko/tap/aerospace"
cask "azure-data-studio"
# cask "bartender"
# mas "BetterSnapTool", id:417375580
cask "boop"
mas "Clocker", id:1056643111
# cask "daisydisk"
mas "Dropover", id:1355679052
# brew "espanso"
cask "google-chrome"
cask "iina"
# mas "Magnet", id:441258766
# cask "microsoft-azure-storage-explorer"
mas "Microsoft Remote Desktop", id:1295203466
brew "openvpn"
cask "postman"
cask "raycast"
cask "slack"
cask "snipaste"
cask "spotify"
mas "TextSniper - OCR, Copy & Paste", id:1528890965
cask "transmit"
# mas "Vinegar - Tube Cleaner", id:1591303229

# IDE-ish
brew "neovim"
cask "rider"
cask "visual-studio-code"
mas "Xcode", id: 497799835

# Programming
brew oven-sh/bun/bun
cask "dotnet"
brew "node"
brew "supabase/tap/supabase"

# Misc
cask "font-fira-code"
brew "font-symbols-only-nerd-font"
cask "font-hack-nerd-font"

## echo "Dropshare"
